```
$ AWS_PROFILE=customer terraform apply -var-file=terraform.tfvar
module.clumio_byok.random_uuid.external_id: Refreshing state... [id=ea74ed66-95ea-492b-228d-638cd4052216]
clumio_wallet.test_wallet: Refreshing state... [id=455372684561]
module.clumio_byok.aws_kms_key.multi_region_cmk_key[0]: Refreshing state... [id=mrk-c31e2af81d8c4f46a8989bd4c768afeb]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # module.clumio_byok.aws_kms_key.multi_region_cmk_key[0] has changed
  ~ resource "aws_kms_key" "multi_region_cmk_key" {
        id                                 = "mrk-c31e2af81d8c4f46a8989bd4c768afeb"
      + tags                               = {}
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.clumio_byok.aws_iam_role.byok_mgmt_role will be created
  + resource "aws_iam_role" "byok_mgmt_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + "ForAnyValue:StringEquals" = {
                              + "sts:ExernalId" = "ea74ed66-95ea-492b-228d-638cd4052216"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::972749477403:root"
                        }
                      + Sid       = "AllowClumioToAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ClumioKMSRole-tf-Org7"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "ReplicaAndGrantManagement"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "kms:TagResource",
                              + "kms:RevokeGrant",
                              + "kms:RetireGrant",
                              + "kms:ReplicateKey",
                              + "kms:PutKeyPolicy",
                              + "kms:ListRetirableGrants",
                              + "kms:ListGrants",
                              + "kms:DescribeKey",
                              + "kms:CreateGrant",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:kms:*:455372684561:key/mrk-c31e2af81d8c4f46a8989bd4c768afeb"
                          + Sid      = ""
                        },
                      + {
                          + Action   = "kms:CreateKey"
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = ""
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.clumio_byok.clumio_post_process_kms.clumio_phone_home will be created
  + resource "clumio_post_process_kms" "clumio_phone_home" {
      + account_id               = "455372684561"
      + created_multi_region_cmk = true
      + id                       = (known after apply)
      + multi_region_cmk_key_id  = "mrk-c31e2af81d8c4f46a8989bd4c768afeb"
      + region                   = "us-west-2"
      + role_arn                 = (known after apply)
      + role_id                  = (known after apply)
      + token                    = "8454355f-edc6-4df7-afd9-31b2d73d6bc0"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.clumio_byok.aws_iam_role.byok_mgmt_role: Creating...
module.clumio_byok.aws_iam_role.byok_mgmt_role: Creation complete after 1s [id=ClumioKMSRole-tf-Org7]
module.clumio_byok.clumio_post_process_kms.clumio_phone_home: Creating...
module.clumio_byok.clumio_post_process_kms.clumio_phone_home: Creation complete after 1s [id=455372684561/us-west-2/8454355f-edc6-4df7-afd9-31b2d73d6bc0]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```